      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('+
     HLOG4RPG V1.12 - 19.07.2015 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D cLOG4RPG_VERSION...
     D                 C                   '1.12'
     D cLOG4RPG_DATE...
     D                 C                   '19.07.2015'
