      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('+
     HLOG4RPG V1.11 - 15.02.2014 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D cLOG4RPG_VERSION...
     D                 C                   '1.11'
     D cLOG4RPG_DATE...
     D                 C                   '15.02.2014'
