      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('+
     HLOG4RPG V1.13.2 - 01.03.2026 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D cLOG4RPG_VERSION...
     D                 C                   '1.13.2'
     D cLOG4RPG_DATE...
     D                 C                   '01.03.2026'
